package first;
import java.util.ArrayList;

public class Main {
    public static void main(String[] args) {

        ArrayList<Person> persons = new ArrayList<>();
        persons.add(new Person("lastname1", "Іванов", "Іван", "вул. Пушкіна, буд. 1", "+380(111)111-11-11"));
        persons.add(new Person("Петров", "Петро", "Петрович", "вул. Лермонтова, буд. 2", "+380(222)222-22-22"));
        persons.add(new Person("Сидоров", "Сидір", "Сидорович", "вул. Тургенєва, буд. 3", "+380(333)333-33-33"));
        persons.add(new Person("Федоров", "Федір", "Федорович", "вул. Гоголя, буд. 4", "+380(444)444-44-44"));


        persons.add(new Abiturient("Сердюк", "Юра", "Іванович", "Будного 32", "+3805427424723", 5.0, "ТНТУ"));
        persons.add(new Abiturient("Баран", "Олег", "Олегович", "Лучаківського 32", "+3805424244532", 4.0, "ТНТУ"));
        persons.add(new Abiturient("Баранюк", "Дмитро", "Вікторович", "Лесі_Українки 32", "+3808765432198", 4.0, "ТНТУ"));


        persons.add(new Student("Воронюк", "Юра", "Вікторович", "Лучаківського 1", "+3909876543217", 3.4, "Туризм", 3, "КІ-406", "пту номер 2"));
        persons.add(new Student("Войтович", "Дмитро", "Юрович", "Курбаса 12", "+3809874675483", 3.4, "Економіка", 5, "КІ-406", "пту номер 1"));
        persons.add(new Student("Гевко", "Богдан", "Дмитрович", "Текстиньна 1", "+3806854864672", 3.0, "Програміст", 4, "КІ-406", "пту номер 4"));
        for (Person person : persons) {
            System.out.println(person);
        }
    }
}
